20260824/20260824/Reports/СБ_ДвиженияДрагМеталлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СБ_ДвиженияДрагМеталлов</Name>
		</Properties>
	</Report>
</MetaDataObject>

20260824/20260824/AccumulationRegisters/СБ_ДвиженияДрагоценныхМеталлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>СБ_ДвиженияДрагоценныхМеталлов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛигатурныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧистыйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияВеса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрагоценныеМатериалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

20260824/20260824/Reports/СБ_ДвиженияДрагМеталлов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода = КонецМесяца(ТекущаяДата());
	Склад = Справочники.Склады.ПустаяСсылка();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		ОбщегоНазначения.СообщитьПользователю("Укажите период отчета.");
		Возврат;
	КонецЕсли;
	
	Если НачалоПериода > КонецПериода Тогда
		ОбщегоНазначения.СообщитьПользователю("Начало периода не может быть позже окончания периода.");
		Возврат;
	КонецЕсли;
	
	ТабДок = СформироватьТабличныйДокумент(НачалоПериода, КонецПериода, Склад);
	
	Если ТабДок.ВысотаТаблицы <= 4 Тогда
		Результат = Новый ТабличныйДокумент;
		ОбщегоНазначения.СообщитьПользователю("По заданным условиям данные не найдены.");
	Иначе
		Результат = ТабДок;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует табличный документ отчета по движению драгоценных металлов.
//
// Параметры:
//  НачалоПериода - Дата - начало периода отчета;
//  КонецПериода  - Дата - конец периода отчета;
//  СкладОтбор    - СправочникСсылка.Склады - склад для отбора (пустая ссылка - все склады).
//
// Возвращаемое значение:
//  ТабличныйДокумент - сформированный отчет.
//
Функция СформироватьТабличныйДокумент(НачалоПериода, КонецПериода, СкладОтбор)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	ДатаНачала = НачалоДня(НачалоПериода);
	ДатаКонца  = КонецДня(КонецПериода);
	
	Записи = ПолучитьЗаписиРегистра(ДатаНачала, ДатаКонца, СкладОтбор);
	
	ВывестиШапку(ТабДок, НачалоПериода, КонецПериода);
	ВывестиДанные(ТабДок, Записи, ДатаНачала);
	
	ОформитьОтчет(ТабДок);
	
	Возврат ТабДок;
	
КонецФункции

// Получает записи регистра движения драгоценных металлов за период.
// Выбираются записи до конца периода (включая записи до начала периода для расчета начального остатка).
//
// Параметры:
//  НачалоПериода - Дата - начало периода;
//  КонецПериода  - Дата - конец периода;
//  СкладОтбор    - СправочникСсылка.Склады - склад для отбора.
//
// Возвращаемое значение:
//  ТаблицаЗначений - записи, упорядоченные по складу, изделию, металлу, периоду.
//
Функция ПолучитьЗаписиРегистра(НачалоПериода, КонецПериода, СкладОтбор)
	
	Условие = "Т.Период <= &КонецПериода";
	Если ЗначениеЗаполнено(СкладОтбор) Тогда
		Условие = Условие + " И Т.Склад = &Склад";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Склад КАК Склад,
	|	Т.НоменклатураРодитель КАК Изделие,
	|	Т.Номенклатура КАК Металл,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Серия КАК Серия,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.ВидДвижения КАК ВидДвижения,
	|	Т.ЛигатурныйВес КАК ЛигатурныйВес,
	|	Т.ЧистыйВес КАК ЧистыйВес
	|ИЗ
	|	РегистрНакопления.СБ_ДвиженияДрагоценныхМеталлов КАК Т
	|ГДЕ
	|	"
	+ Условие
	+ " УПОРЯДОЧИТЬ ПО
	|	Склад,
	|	Изделие,
	|	Металл,
	|	Период";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Если ЗначениеЗаполнено(СкладОтбор) Тогда
		Запрос.УстановитьПараметр("Склад", СкладОтбор);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Выводит заголовок отчета и шапку таблицы.
//
// Параметры:
//  ТабДок        - ТабличныйДокумент;
//  НачалоПериода - Дата;
//  КонецПериода  - Дата.
//
Процедура ВывестиШапку(ТабДок, НачалоПериода, КонецПериода)
	
	ТабДок.Область("R1C1").Текст = "Отчет по движению драгоценных металлов";
	ТабДок.Область("R1C1").Шрифт = Новый Шрифт(ТабДок.Область("R1C1").Шрифт, , 14, Истина);
	
	ПериодТекст = "Период: с " + Формат(НачалоПериода, "ДЛФ=Д") + " по " + Формат(КонецПериода, "ДЛФ=Д");
	ТабДок.Область("R2C1").Текст = ПериодТекст;
	
	// Заголовки строковых колонок.
	ТабДок.Область("R3C1").Текст = "Склад";
	ТабДок.Область("R3C2").Текст = "Артикул";
	ТабДок.Область("R3C3").Текст = "Драг. Металл";
	ТабДок.Область("R3C4").Текст = "Регистратор";
	
	// Заголовки групп.
	ЗаголовкиГрупп = Новый Соответствие;
	ЗаголовкиГрупп.Вставить(5, "Начальный остаток");
	ЗаголовкиГрупп.Вставить(7, "Приход");
	ЗаголовкиГрупп.Вставить(9, "Расход");
	ЗаголовкиГрупп.Вставить(11, "Конечный остаток");
	
	Для Каждого Элемент Из ЗаголовкиГрупп Цикл
		Колонка = Элемент.Ключ;
		ТабДок.Область(3, Колонка).Текст = Элемент.Значение;
		ТабДок.Область(3, Колонка, 3, Колонка + 1).Объединить();
	КонецЦикла;
	
	// Подзаголовки "Лигатурный вес" / "Чистый вес".
	Для Колонка = 5 По 12 Цикл
		Если Четное(Колонка) Тогда
			ТабДок.Область(4, Колонка).Текст = "Чистый вес";
		Иначе
			ТабДок.Область(4, Колонка).Текст = "Лигатурный вес";
		КонецЕсли;
	КонецЦикла;
	
	// Слияние заголовков строковых колонок на две строки.
	Для Колонка = 1 По 4 Цикл
		ТабДок.Область(3, Колонка, 4, Колонка).Объединить();
	КонецЦикла;
	
	// Слияние заголовка и периода на ширину отчета.
	ТабДок.Область("R1C1:R1C12").Объединить();
	ТабДок.Область("R2C1:R2C12").Объединить();
	
КонецПроцедуры

// Выводит данные отчета: иерархия склад -> изделие (артикул) -> драг. металл -> регистратор.
//
// Параметры:
//  ТабДок       - ТабличныйДокумент;
//  Записи       - ТаблицаЗначений - записи регистра;
//  ДатаНачала   - Дата - начало периода отчета.
//
Процедура ВывестиДанные(ТабДок, Записи, ДатаНачала)
	
	НомерСтроки = 5;
	Индекс = 0;
	Пока Индекс < Записи.Количество() Цикл
		
		// ------ Склад ------
		СтрокаСклада = Записи[Индекс];
		КонецСклада = Индекс;
		Пока КонецСклада < Записи.Количество()
			И Записи[КонецСклада].Склад = СтрокаСклада.Склад Цикл
			КонецСклада = КонецСклада + 1;
		КонецЦикла;
		
		// ------ Изделия склада ------
		Пока Индекс < КонецСклада Цикл
			
			СтрокаИзделия = Записи[Индекс];
			КонецИзделия = Индекс;
			Пока КонецИзделия < КонецСклада
				И Записи[КонецИзделия].Изделие = СтрокаИзделия.Изделие
				И Записи[КонецИзделия].Характеристика = СтрокаИзделия.Характеристика
				И Записи[КонецИзделия].Серия = СтрокаИзделия.Серия Цикл
				КонецИзделия = КонецИзделия + 1;
			КонецЦикла;
			
			ИтогиИзделия = Новый Структура("ЛигНач, ЧистНач, ЛигПрих, ЧистПрих, ЛигРасх, ЧистРасх", 0, 0, 0, 0, 0, 0);
			
			// Строка изделия (заполняется итогами после металлов).
			НомерСтрокиИзделия = НомерСтроки;
			ТабДок.Область(НомерСтроки, 1).Текст = СтрокаИзделия.Склад;
			ТабДок.Область(НомерСтроки, 2).Текст = СтрокаИзделия.Изделие;
			НомерСтроки = НомерСтроки + 1;
			
			// ------ Металлы изделия ------
			Пока Индекс < КонецИзделия Цикл
				
				СтрокаМеталла = Записи[Индекс];
				КонецМеталла = Индекс;
				Пока КонецМеталла < КонецИзделия
					И Записи[КонецМеталла].Металл = СтрокаМеталла.Металл Цикл
					КонецМеталла = КонецМеталла + 1;
				КонецЦикла;
				
				// Подсчет начального остатка и движений по металлу.
				НачЛиг = 0;
				НачЧист = 0;
				ПрихЛиг = 0;
				ПрихЧист = 0;
				РасхЛиг = 0;
				РасхЧист = 0;
				Движения = Новый Массив;
				
				Для НомерЗаписи = Индекс По КонецМеталла - 1 Цикл
					Строка = Записи[НомерЗаписи];
					Если Строка.Период < ДатаНачала Тогда
						Если Строка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
							НачЛиг = НачЛиг + Строка.ЛигатурныйВес;
							НачЧист = НачЧист + Строка.ЧистыйВес;
						Иначе
							НачЛиг = НачЛиг - Строка.ЛигатурныйВес;
							НачЧист = НачЧист - Строка.ЧистыйВес;
						КонецЕсли;
					Иначе
						Движения.Добавить(Строка);
						Если Строка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
							ПрихЛиг = ПрихЛиг + Строка.ЛигатурныйВес;
							ПрихЧист = ПрихЧист + Строка.ЧистыйВес;
						Иначе
							РасхЛиг = РасхЛиг + Строка.ЛигатурныйВес;
							РасхЧист = РасхЧист + Строка.ЧистыйВес;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				// Накопление в итоги изделия.
				ИтогиИзделия.ЛигНач = ИтогиИзделия.ЛигНач + НачЛиг;
				ИтогиИзделия.ЧистНач = ИтогиИзделия.ЧистНач + НачЧист;
				ИтогиИзделия.ЛигПрих = ИтогиИзделия.ЛигПрих + ПрихЛиг;
				ИтогиИзделия.ЧистПрих = ИтогиИзделия.ЧистПрих + ПрихЧист;
				ИтогиИзделия.ЛигРасх = ИтогиИзделия.ЛигРасх + РасхЛиг;
				ИтогиИзделия.ЧистРасх = ИтогиИзделия.ЧистРасх + РасхЧист;
				
				// Строка металла (под-итог).
				ТабДок.Область(НомерСтроки, 3).Текст = СтрокаМеталла.Металл;
				ТабДок.Область(НомерСтроки, 5).Текст  = ФорматВеса(НачЛиг);
				ТабДок.Область(НомерСтроки, 6).Текст  = ФорматВеса(НачЧист);
				ТабДок.Область(НомерСтроки, 7).Текст  = ФорматВеса(ПрихЛиг);
				ТабДок.Область(НомерСтроки, 8).Текст  = ФорматВеса(ПрихЧист);
				ТабДок.Область(НомерСтроки, 9).Текст  = ФорматВеса(РасхЛиг);
				ТабДок.Область(НомерСтроки, 10).Текст = ФорматВеса(РасхЧист);
				ТабДок.Область(НомерСтроки, 11).Текст = ФорматВеса(НачЛиг + ПрихЛиг - РасхЛиг);
				ТабДок.Область(НомерСтроки, 12).Текст = ФорматВеса(НачЧист + ПрихЧист - РасхЧист);
				НомерСтроки = НомерСтроки + 1;
				
				// Движения (регистраторы).
				Для Каждого Движение Из Движения Цикл
					ТабДок.Область(НомерСтроки, 4).Текст = Движение.Регистратор;
					Если Движение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						ТабДок.Область(НомерСтроки, 7).Текст  = ФорматВеса(Движение.ЛигатурныйВес);
						ТабДок.Область(НомерСтроки, 8).Текст  = ФорматВеса(Движение.ЧистыйВес);
					Иначе
						ТабДок.Область(НомерСтроки, 9).Текст  = ФорматВеса(Движение.ЛигатурныйВес);
						ТабДок.Область(НомерСтроки, 10).Текст = ФорматВеса(Движение.ЧистыйВес);
					КонецЕсли;
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла;
				
				Индекс = КонецМеталла;
			КонецЦикла;
			
			// Заполняем строку изделия итогами.
			ТабДок.Область(НомерСтрокиИзделия, 5).Текст  = ФорматВеса(ИтогиИзделия.ЛигНач);
			ТабДок.Область(НомерСтрокиИзделия, 6).Текст  = ФорматВеса(ИтогиИзделия.ЧистНач);
			ТабДок.Область(НомерСтрокиИзделия, 7).Текст  = ФорматВеса(ИтогиИзделия.ЛигПрих);
			ТабДок.Область(НомерСтрокиИзделия, 8).Текст  = ФорматВеса(ИтогиИзделия.ЧистПрих);
			ТабДок.Область(НомерСтрокиИзделия, 9).Текст  = ФорматВеса(ИтогиИзделия.ЛигРасх);
			ТабДок.Область(НомерСтрокиИзделия, 10).Текст = ФорматВеса(ИтогиИзделия.ЧистРасх);
			ТабДок.Область(НомерСтрокиИзделия, 11).Текст = ФорматВеса(ИтогиИзделия.ЛигНач + ИтогиИзделия.ЛигПрих - ИтогиИзделия.ЛигРасх);
			ТабДок.Область(НомерСтрокиИзделия, 12).Текст = ФорматВеса(ИтогиИзделия.ЧистНач + ИтогиИзделия.ЧистПрих - ИтогиИзделия.ЧистРасх);
			
		КонецЦикла;
		
		Индекс = КонецСклада;
		
	КонецЦикла;
	
КонецПроцедуры

// Оформляет отчет: жирный заголовок, выравнивание, границы.
Процедура ОформитьОтчет(ТабДок)
	
	ТабДок.Область("R1C1").ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабДок.Область("R2C1").ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	Шапка = ТабДок.Область(3, 1, 4, 12);
	Шапка.Шрифт = Новый Шрифт(Шапка.Шрифт, , , Истина);
	Шапка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Шапка.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	
	// Границы.
	ПоследняяСтрока = ТабДок.ВысотаТаблицы;
	Если ПоследняяСтрока >= 3 Тогда
		ОбластьДанных = ТабДок.Область(3, 1, ПоследняяСтрока, 12);
		ОбластьДанных.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		ОбластьДанных.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		ОбластьДанных.ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		ОбластьДанных.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	КонецЕсли;
	
КонецПроцедуры

// Форматирует вес в строку с тремя знаками после запятой.
Функция ФорматВеса(Значение)
	
	Возврат Формат(Значение, "ЧДЦ=3");
	
КонецФункции

// Проверяет четность числа.
Функция Четное(Число)
	
	Возврат Число - 2 * Цел(Число / 2) = 0;
	
КонецФункции

#КонецОбласти
